Конфигурация/Documents/РаспределениеАктивовЕПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РаспределениеАктивовЕПС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РаспределенияАктивовЕПС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСделке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Рынок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:CatalogRef.Паи</v8:Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
								<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетныйАктивЕПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/Сделка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Сделка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКПолучению</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>InformationRegister.УсловияСделок</xr:Item>
				<xr:Item>AccumulationRegister.РезервыПИФ</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииСрочныхКонтрактов</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоЦеннымБумагам</xr:Item>
				<xr:Item>AccumulationRegister.РасходыПоСделке</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумаг</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ЗначенияНастроекУчетаЦенныхБумаг</xr:Item>
				<xr:Item>InformationRegister.ПлановыеДатыОплат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРасчетовНаБирже</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимБиржевыхТоргов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РежимыБиржевыхТоргов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеполныеЛоты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПереговорныхСделок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентНаБирже</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыкупЭмитентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичноеРазмещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговораКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложенноеИсполнение</Name>
					<Comment>При установленном флаге документ создает задолженность по ц/б и д/с, при сброшенном — двигает остатки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаздельноеИсполнение</Name>
					<Comment>Оплата и поставка при отложенном исполнении планируются в разные дни</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложеннаяОплатаТорговойКомиссии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыТорговойКомиссии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаТорговойКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственныйКурсОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеУсловиеСделки</Name>
					<Comment>Для внебиржевых сделок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>20</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриобретениеПаев</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПорученияУБрокера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПорученияУБрокера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДепозитарныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПроцент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговаяКомиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаКомиссии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/РаспределениеАктивовЕПС/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиСделкаПриИзменении(Элемент)
	ЦенныеБумагиСделкаПриИзмененииНаСервере(Элементы.ЦенныеБумаги.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ЦенныеБумагиСделкаПриИзмененииНаСервере(ИдСтрокиЦБ)
	
	ТекСтрока = Объект.ЦенныеБумаги.НайтиПоИдентификатору(ИдСтрокиЦБ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаЦенныеБумаги.Ссылка.Рынок,
		|	СделкаЦенныеБумаги.ЦеннаяБумага,
		|	СделкаЦенныеБумаги.Количество
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|ГДЕ
		|	СделкаЦенныеБумаги.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СделкаРЕПОЦенныеБумаги.Ссылка.Рынок,
		|	СделкаРЕПОЦенныеБумаги.ЦеннаяБумага,
		|	СделкаРЕПОЦенныеБумаги.Количество
		|ИЗ
		|	Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|ГДЕ
		|	СделкаРЕПОЦенныеБумаги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекСтрока.Сделка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекСтрока.Рынок        = ВыборкаДетальныеЗаписи.Рынок;
		ТекСтрока.ЦеннаяБумага = ВыборкаДетальныеЗаписи.ЦеннаяБумага;
		ТекСтрока.Количество   = ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(ЦеннаяБумага, УчетныйАктивЕПС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаЦенныеБумаги.Ссылка.Рынок КАК Рынок,
		|	&ЦеннаяБумага КАК ЦеннаяБумага,
		|	СделкаЦенныеБумаги.Количество КАК Количество,
		|	СделкаЦенныеБумаги.Ссылка КАК Сделка,
		|	&УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|ГДЕ
		|	СделкаЦенныеБумаги.Ссылка.Дата МЕЖДУ &НачалоДня И &КонецДня
		|	И СделкаЦенныеБумаги.Ссылка.Организация = &Организация
		|	И СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СделкаЦенныеБумаги.ЦеннаяБумага = &ЦеннаяБумага
		|	И СделкаЦенныеБумаги.Ссылка.ВидСделки = &ВидСделки";

	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидСделки", Перечисления.ВидыСделок.Покупка);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("УчетныйАктивЕПС", УчетныйАктивЕПС);

	Объект.ЦенныеБумаги.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	БумагаАктив = ОткрытьФормуМодально("Документ.РаспределениеАктивовЕПС.Форма.ФормаВыбораРаспределения");
	
	Если БумагаАктив <> Неопределено Тогда
	
		ЗаполнитьНаСервере(БумагаАктив.ЦеннаяБумага, БумагаАктив.УчетныйАктивЕПС);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЭСПНаРыночностьСервере(НомерСтроки)
	
	ДатаПереоценки = НачалоДня(Объект.Дата);
	
	СтрокаЦенныеБумаги = Объект.ЦенныеБумаги[НомерСтроки - 1];
	
	МассивСтрок = Новый Массив();
	МассивСтрок.Добавить(СтрокаЦенныеБумаги);
	
	ДанныеЦенныеБумаги = Объект.ЦенныеБумаги.Выгрузить(МассивСтрок);
	ДанныеЦенныеБумаги.Колонки.Сделка.Имя = "Партия";
	
	ДанныеЦенныеБумаги.Колонки.Добавить("СтрокаПартии", Метаданные.ОпределяемыеТипы.СтрокаПартии.Тип);
	Для каждого СтрокаДанныеЦенныеБумаги Из ДанныеЦенныеБумаги Цикл
		СтрокаДанныеЦенныеБумаги.СтрокаПартии = 1;
	КонецЦикла;
	
	ДатыИЦеныПокупки = БухгалтерскийУчетЕПС.ПолучитьДатыИЦеныПокупки(ДанныеЦенныеБумаги, Объект.СчетДоверительногоУправления, ДатаПереоценки).Выгрузить();
	
	ПараметрыПроверки = РаботаСКоллекциями.ТаблицаЗначений_В_МассивСтруктур(ДатыИЦеныПокупки);
	
	Облигация = СтрокаЦенныеБумаги.ЦеннаяБумага;
	
	ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет;
	ЦельРасчета = БухгалтерскийУчет.ОпределитьЦельРасчетаПоВидуУчета(ВидУчета);
	НастройкиЦелиРасчета = БухгалтерскийУчет.ОпределитьНастройкиЦелиРасчета(ДатаПереоценки, Объект.Организация, Объект.СчетДоверительногоУправления, ЦельРасчета);
	ВариантРасчетаОценочнойСтоимости = НастройкиЦелиРасчета.ВариантРасчетаОценочнойСтоимости;
	
	ПараметрыОценки = Новый Структура;
	ПараметрыОценки.Вставить("Организация",							Объект.Организация);
	ПараметрыОценки.Вставить("СчетДоверительногоУправления",		Объект.СчетДоверительногоУправления);
	ПараметрыОценки.Вставить("ВидУчета",							ВидУчета);
	ПараметрыОценки.Вставить("ВариантРасчетаСправедливойСтоимости",	ВариантРасчетаОценочнойСтоимости);
	ПараметрыОценки.Вставить("Клиент",								Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Объект.СчетДоверительногоУправления, ДатаПереоценки));
	ПараметрыОценки.Вставить("ПараметрыПолученияПартий",			РаботаСПереоценкой.ПолучитьПараметрыПолученияПартийПоМетодике(ЦельРасчета, ВидУчета, ВариантРасчетаОценочнойСтоимости, ДатаПереоценки));
	
	Отказ = Ложь;
	
	ПараметрыДенежногоПотока = РаботаСПереоценкой.ПолучитьПараметрыДенежногоПотока(ПараметрыОценки, ДатаПереоценки, Облигация, Отказ);
	Если Отказ Тогда
	    Возврат Неопределено;
	КонецЕсли;
	
	ДоходностьДюрация = Справочники.Облигации.ПолучитьДоходностьИДюрацию(
							Облигация,
							ПараметрыДенежногоПотока.ДоДатыПогашения,
							ДатаПереоценки,
							ПараметрыПроверки[0].ЦенаПокупки,
							Объект.СчетДоверительногоУправления,
							ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС").Биржа);
	
	Если ТипЗнч(ДоходностьДюрация) = Тип("Структура") Тогда
		
		ЭСП = ДоходностьДюрация.Доходность;
		
		НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ДатаПереоценки, Объект.Организация, Объект.СчетДоверительногоУправления);
		Если НастройкиУчета.РазрядностьОкругленияЭСП > 0 Тогда
			ЭСП = Окр(ЭСП, НастройкиУчета.РазрядностьОкругленияЭСП);
		Иначе
			ЭСП = Метаданные.ОпределяемыеТипы.ЭффективнаяПроцентнаяСтавка.Тип.ПривестиЗначение(ЭСП);	
		КонецЕсли;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
	Отчет = Новый ТабличныйДокумент;;
	
	Если БухгалтерскийУчетЕПС.ПроверитьЭСПНаРыночность(Облигация, ЭСП, ДатаПереоценки, Объект.СчетДоверительногоУправления, Отчет, ПараметрыПроверки[0], Отказ) <> Неопределено Тогда
		Возврат Отчет;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьЭСПНаРыночность(Команда)
	
	ДанныеЦенныхБумаг = ЭтаФорма.Элементы.ЦенныеБумаги.ТекущиеДанные;
	Если ДанныеЦенныхБумаг = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите сделку!");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеЦенныхБумаг.УчетныйАктивЕПС) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран учетный актив ЕПС!");
		Возврат;
	КонецЕсли;
	
	Отчет = ПроверитьЭСПНаРыночностьСервере(ДанныеЦенныхБумаг.НомерСтроки);
	
	Если Отчет <> Неопределено Тогда
		Отчет.Показать("ПроверкаЭСП");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект = Форма.Объект;
	
	Если ЗначениеЗаполнено(Объект.ПоСделке) Тогда
		Форма.Элементы.РучнойВвод.Видимость = Истина;
		Форма.Элементы.СчетДоверительногоУправления.Доступность = Объект.РучнойВвод;
		Форма.Элементы.ЦенныеБумаги.ТолькоПросмотр = Не Объект.РучнойВвод;
		Форма.Элементы.ЦенныеБумагиЗаполнить.Доступность = Объект.РучнойВвод;
	Иначе	
		Форма.Элементы.РучнойВвод.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Асинх Процедура РучнаяКорректировкаПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
	Если Не Объект.РучнойВвод Тогда
	
		РезультатВопроса = Ждать ВопросАсинх("При отключении ручного режима производится возврат к автоматически рассчитанным показателям. Вы уверены?", РежимДиалогаВопрос.ДаНет);
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			РаспределитьАктивыЕПС();
		Иначе
			Объект.РучнойВвод = Истина;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьАктивыЕПС()
	
	КлиентДоверительногоУправления = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Объект.СчетДоверительногоУправления, Объект.Дата);
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления);
	
	НастройкиЦенныхБумаг = НастройкиУчета.НастройкиУчетаЦенныхБумаг;
	
	Для Каждого СтрокаЦенныеБумаги Из Объект.ЦенныеБумаги Цикл
		
		ОбъектРаспределения = Новый Структура;
		ОбъектРаспределения.Вставить("ЦеннаяБумага", СтрокаЦенныеБумаги.ЦеннаяБумага);
		ОбъектРаспределения.Вставить("НастройкиЦенныхБумаг", НастройкиЦенныхБумаг);
		ОбъектРаспределения.Вставить("Дата", Объект.Дата);
		ОбъектРаспределения.Вставить("Ссылка", СтрокаЦенныеБумаги.Сделка);
		ОбъектРаспределения.Вставить("СтрокаПартии", 1);

		Отказ = Ложь;
		
		УчетныйАктивЕПС = БухгалтерскийУчетЕПС.РаспределитьАктивЕПС(Объект.СчетДоверительногоУправления, КлиентДоверительногоУправления, ОбъектРаспределения, Отказ);

		Если Не Отказ И ЗначениеЗаполнено(УчетныйАктивЕПС) Тогда
			
			СтрокаЦенныеБумаги.УчетныйАктивЕПС = УчетныйАктивЕПС;
			
		Иначе	
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось автоматически распределить ценную бумагу " + Строка(СтрокаЦенныеБумаги.ЦеннаяБумага), , , , Отказ);
			
			Объект.РучнойВвод = Истина;
			
			Возврат;
			
		КонецЕсли;	
						
	КонецЦикла;						
						
КонецПроцедуры
